## one hot encoding and label encoding

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [24]:
import pandas as pd
data = pd.read_csv('carprices.csv')
data.head()

  Car_Model  Mileage  Sell Price($)  Age(yrs)
0    BMW X5    69000          18000         6
1    BMW X5    35000          34000         3
2    BMW X5    57000          26100         5
3    BMW X5    22500          40000         2
4    BMW X5    46000          31500         4

## one hot encoding
## It represent types of data which may be divided into groups.
## Categorical Data into NUmeric Data

In [26]:
pd.get_dummies(data.Car_Model)

    Audi A5  BMW X5  Mercedez Benz C class
0         0       1                      0
1         0       1                      0
2         0       1                      0
3         0       1                      0
4         0       1                      0
5         1       0                      0
6         1       0                      0
7         1       0                      0
8         1       0                      0
9         0       0                      1
10        0       0                      1
11        0       0                      1
12        0       0                      1

In [8]:
data.Car_Model.value_counts()

BMW X5                   5
Mercedez Benz C class    4
Audi A5                  4
Name: Car_Model, dtype: int64

In [10]:
data.shape

(13, 4)

In [12]:
pd.get_dummies(data).shape

(13, 6)

## LabelEncoding

## To convert the labels into a numeric form so as to convert them into the machine -readable form.

In [15]:
le = LabelEncoder()

In [21]:
data.Car_Model = le.fit_transform(data.Car_Model)

In [22]:
data

    Car_Model  Mileage  Sell Price($)  Age(yrs)
0           1    69000          18000         6
1           1    35000          34000         3
2           1    57000          26100         5
3           1    22500          40000         2
4           1    46000          31500         4
5           0    59000          29400         5
6           0    52000          32000         5
7           0    72000          19300         6
8           0    91000          12000         8
9           2    67000          22000         6
10          2    83000          20000         7
11          2    79000          21000         7
12          2    59000          33000         5